// Generated by jextract

package com.chrisribble.ffmpeg5;

import java.lang.invoke.MethodHandle;
import java.lang.invoke.VarHandle;
import java.nio.ByteOrder;
import java.lang.foreign.*;
import static java.lang.foreign.ValueLayout.*;
final class constants$209 {

    // Suppresses default constructor, ensuring non-instantiability.
    private constants$209() {}
    static final VarHandle const$0 = constants$208.const$3.varHandle(MemoryLayout.PathElement.groupElement("qscale"));
    static final VarHandle const$1 = constants$208.const$3.varHandle(MemoryLayout.PathElement.groupElement("quality_factor"));
    static final StructLayout const$2 = MemoryLayout.structLayout(
        RuntimeHelper.POINTER.withName("av_class"),
        JAVA_INT.withName("log_level_offset"),
        JAVA_INT.withName("codec_type"),
        RuntimeHelper.POINTER.withName("codec"),
        JAVA_INT.withName("codec_id"),
        JAVA_INT.withName("codec_tag"),
        RuntimeHelper.POINTER.withName("priv_data"),
        RuntimeHelper.POINTER.withName("internal"),
        RuntimeHelper.POINTER.withName("opaque"),
        JAVA_LONG.withName("bit_rate"),
        JAVA_INT.withName("bit_rate_tolerance"),
        JAVA_INT.withName("global_quality"),
        JAVA_INT.withName("compression_level"),
        JAVA_INT.withName("flags"),
        JAVA_INT.withName("flags2"),
        MemoryLayout.paddingLayout(4),
        RuntimeHelper.POINTER.withName("extradata"),
        JAVA_INT.withName("extradata_size"),
        MemoryLayout.structLayout(
            JAVA_INT.withName("num"),
            JAVA_INT.withName("den")
        ).withName("time_base"),
        JAVA_INT.withName("ticks_per_frame"),
        JAVA_INT.withName("delay"),
        JAVA_INT.withName("width"),
        JAVA_INT.withName("height"),
        JAVA_INT.withName("coded_width"),
        JAVA_INT.withName("coded_height"),
        JAVA_INT.withName("gop_size"),
        JAVA_INT.withName("pix_fmt"),
        MemoryLayout.paddingLayout(4),
        RuntimeHelper.POINTER.withName("draw_horiz_band"),
        RuntimeHelper.POINTER.withName("get_format"),
        JAVA_INT.withName("max_b_frames"),
        JAVA_FLOAT.withName("b_quant_factor"),
        JAVA_FLOAT.withName("b_quant_offset"),
        JAVA_INT.withName("has_b_frames"),
        JAVA_FLOAT.withName("i_quant_factor"),
        JAVA_FLOAT.withName("i_quant_offset"),
        JAVA_FLOAT.withName("lumi_masking"),
        JAVA_FLOAT.withName("temporal_cplx_masking"),
        JAVA_FLOAT.withName("spatial_cplx_masking"),
        JAVA_FLOAT.withName("p_masking"),
        JAVA_FLOAT.withName("dark_masking"),
        JAVA_INT.withName("slice_count"),
        RuntimeHelper.POINTER.withName("slice_offset"),
        MemoryLayout.structLayout(
            JAVA_INT.withName("num"),
            JAVA_INT.withName("den")
        ).withName("sample_aspect_ratio"),
        JAVA_INT.withName("me_cmp"),
        JAVA_INT.withName("me_sub_cmp"),
        JAVA_INT.withName("mb_cmp"),
        JAVA_INT.withName("ildct_cmp"),
        JAVA_INT.withName("dia_size"),
        JAVA_INT.withName("last_predictor_count"),
        JAVA_INT.withName("me_pre_cmp"),
        JAVA_INT.withName("pre_dia_size"),
        JAVA_INT.withName("me_subpel_quality"),
        JAVA_INT.withName("me_range"),
        JAVA_INT.withName("slice_flags"),
        JAVA_INT.withName("mb_decision"),
        RuntimeHelper.POINTER.withName("intra_matrix"),
        RuntimeHelper.POINTER.withName("inter_matrix"),
        JAVA_INT.withName("intra_dc_precision"),
        JAVA_INT.withName("skip_top"),
        JAVA_INT.withName("skip_bottom"),
        JAVA_INT.withName("mb_lmin"),
        JAVA_INT.withName("mb_lmax"),
        JAVA_INT.withName("bidir_refine"),
        JAVA_INT.withName("keyint_min"),
        JAVA_INT.withName("refs"),
        JAVA_INT.withName("mv0_threshold"),
        JAVA_INT.withName("color_primaries"),
        JAVA_INT.withName("color_trc"),
        JAVA_INT.withName("colorspace"),
        JAVA_INT.withName("color_range"),
        JAVA_INT.withName("chroma_sample_location"),
        JAVA_INT.withName("slices"),
        JAVA_INT.withName("field_order"),
        JAVA_INT.withName("sample_rate"),
        JAVA_INT.withName("channels"),
        JAVA_INT.withName("sample_fmt"),
        JAVA_INT.withName("frame_size"),
        JAVA_INT.withName("frame_number"),
        JAVA_INT.withName("block_align"),
        JAVA_INT.withName("cutoff"),
        MemoryLayout.paddingLayout(4),
        JAVA_LONG.withName("channel_layout"),
        JAVA_LONG.withName("request_channel_layout"),
        JAVA_INT.withName("audio_service_type"),
        JAVA_INT.withName("request_sample_fmt"),
        RuntimeHelper.POINTER.withName("get_buffer2"),
        JAVA_FLOAT.withName("qcompress"),
        JAVA_FLOAT.withName("qblur"),
        JAVA_INT.withName("qmin"),
        JAVA_INT.withName("qmax"),
        JAVA_INT.withName("max_qdiff"),
        JAVA_INT.withName("rc_buffer_size"),
        JAVA_INT.withName("rc_override_count"),
        MemoryLayout.paddingLayout(4),
        RuntimeHelper.POINTER.withName("rc_override"),
        JAVA_LONG.withName("rc_max_rate"),
        JAVA_LONG.withName("rc_min_rate"),
        JAVA_FLOAT.withName("rc_max_available_vbv_use"),
        JAVA_FLOAT.withName("rc_min_vbv_overflow_use"),
        JAVA_INT.withName("rc_initial_buffer_occupancy"),
        JAVA_INT.withName("trellis"),
        RuntimeHelper.POINTER.withName("stats_out"),
        RuntimeHelper.POINTER.withName("stats_in"),
        JAVA_INT.withName("workaround_bugs"),
        JAVA_INT.withName("strict_std_compliance"),
        JAVA_INT.withName("error_concealment"),
        JAVA_INT.withName("debug"),
        JAVA_INT.withName("err_recognition"),
        MemoryLayout.paddingLayout(4),
        JAVA_LONG.withName("reordered_opaque"),
        RuntimeHelper.POINTER.withName("hwaccel"),
        RuntimeHelper.POINTER.withName("hwaccel_context"),
        MemoryLayout.sequenceLayout(8, JAVA_LONG).withName("error"),
        JAVA_INT.withName("dct_algo"),
        JAVA_INT.withName("idct_algo"),
        JAVA_INT.withName("bits_per_coded_sample"),
        JAVA_INT.withName("bits_per_raw_sample"),
        JAVA_INT.withName("lowres"),
        JAVA_INT.withName("thread_count"),
        JAVA_INT.withName("thread_type"),
        JAVA_INT.withName("active_thread_type"),
        JAVA_INT.withName("thread_safe_callbacks"),
        MemoryLayout.paddingLayout(4),
        RuntimeHelper.POINTER.withName("execute"),
        RuntimeHelper.POINTER.withName("execute2"),
        JAVA_INT.withName("nsse_weight"),
        JAVA_INT.withName("profile"),
        JAVA_INT.withName("level"),
        JAVA_INT.withName("skip_loop_filter"),
        JAVA_INT.withName("skip_idct"),
        JAVA_INT.withName("skip_frame"),
        RuntimeHelper.POINTER.withName("subtitle_header"),
        JAVA_INT.withName("subtitle_header_size"),
        JAVA_INT.withName("initial_padding"),
        MemoryLayout.structLayout(
            JAVA_INT.withName("num"),
            JAVA_INT.withName("den")
        ).withName("framerate"),
        JAVA_INT.withName("sw_pix_fmt"),
        MemoryLayout.structLayout(
            JAVA_INT.withName("num"),
            JAVA_INT.withName("den")
        ).withName("pkt_timebase"),
        MemoryLayout.paddingLayout(4),
        RuntimeHelper.POINTER.withName("codec_descriptor"),
        JAVA_LONG.withName("pts_correction_num_faulty_pts"),
        JAVA_LONG.withName("pts_correction_num_faulty_dts"),
        JAVA_LONG.withName("pts_correction_last_pts"),
        JAVA_LONG.withName("pts_correction_last_dts"),
        RuntimeHelper.POINTER.withName("sub_charenc"),
        JAVA_INT.withName("sub_charenc_mode"),
        JAVA_INT.withName("skip_alpha"),
        JAVA_INT.withName("seek_preroll"),
        JAVA_INT.withName("debug_mv"),
        RuntimeHelper.POINTER.withName("chroma_intra_matrix"),
        RuntimeHelper.POINTER.withName("dump_separator"),
        RuntimeHelper.POINTER.withName("codec_whitelist"),
        JAVA_INT.withName("properties"),
        MemoryLayout.paddingLayout(4),
        RuntimeHelper.POINTER.withName("coded_side_data"),
        JAVA_INT.withName("nb_coded_side_data"),
        MemoryLayout.paddingLayout(4),
        RuntimeHelper.POINTER.withName("hw_frames_ctx"),
        JAVA_INT.withName("sub_text_format"),
        JAVA_INT.withName("trailing_padding"),
        JAVA_LONG.withName("max_pixels"),
        RuntimeHelper.POINTER.withName("hw_device_ctx"),
        JAVA_INT.withName("hwaccel_flags"),
        JAVA_INT.withName("apply_cropping"),
        JAVA_INT.withName("extra_hw_frames"),
        JAVA_INT.withName("discard_damaged_percentage"),
        JAVA_LONG.withName("max_samples"),
        JAVA_INT.withName("export_side_data"),
        MemoryLayout.paddingLayout(4),
        RuntimeHelper.POINTER.withName("get_encode_buffer"),
        MemoryLayout.structLayout(
            JAVA_INT.withName("order"),
            JAVA_INT.withName("nb_channels"),
            MemoryLayout.unionLayout(
                JAVA_LONG.withName("mask"),
                RuntimeHelper.POINTER.withName("map")
            ).withName("u"),
            RuntimeHelper.POINTER.withName("opaque")
        ).withName("ch_layout")
    ).withName("AVCodecContext");
    static final VarHandle const$3 = constants$209.const$2.varHandle(MemoryLayout.PathElement.groupElement("av_class"));
    static final VarHandle const$4 = constants$209.const$2.varHandle(MemoryLayout.PathElement.groupElement("log_level_offset"));
    static final VarHandle const$5 = constants$209.const$2.varHandle(MemoryLayout.PathElement.groupElement("codec_type"));
}


